In [ ]:
#Q1. List any five functions of the pandas library with execution.

head()
describe()
tail()
read()
loc()
iloc()

In [ ]:
#Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
     #DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'a' : [1,2,3,4,5], 'b' : [0,3,2,1,1] , 'c' : [0,0,9,9,9]})

In [7]:
new_index = pd.RangeIndex(start = 1 , stop=2*len(df) , step=2)

In [8]:
df = df.reindex(new_index)

In [9]:
df

   a  b  c
1  2  3  0
3  4  1  9

In [ ]:
'''Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.''

In [11]:
import pandas as pd

In [23]:
df = pd.DataFrame({'value' : [10, 20, 30, 40, 50]})

In [24]:
a = df['value'][0:3].sum()

In [25]:
print(a)

60

In [10]:
#Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
# Word_Count' that contains the number of words in each row of the 'Text' column.

In [11]:
df = pd.DataFrame({'Text' : ['Ronak','jay','rk','s']})

In [40]:
df['Word_Count'] = df["Text"].apply(lambda n: len(n))

In [41]:
df

    Text  Word_Count
0  Ronak           5
1    jay           3
2     rk           2
3      s           1

In [ ]:
#Q5. How are DataFrame.size() and DataFrame.shape() different?


'''
size():
   return s size of dataframe whis is equivalent to total number of elements that is row x columns
  
shape():
	returns tuple of shape (Rows, columns) of dataframe/series
   
   '''

In [ ]:
#Q6. Which function of pandas do we use to read an excel file?

'''pandas.read_excel() function of pandas do we use to read an excel file'''

In [ ]:
#Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
#addresses in the format 'username@domain.com'. Write a Python function that creates a new column
#'Username' in df that contains only the username part of each email address.

In [4]:
import pandas as pd

In [8]:
df = pd.DataFrame({'Email': ['username@domain.com', 'username2@domain.com','username3@domain.com']})

In [25]:
df['Username'] = df['Email'].apply(lambda x : x.split('@')[0])

In [26]:
df

                  Email   Username
0   username@domain.com   username
1  username2@domain.com  username2
2  username3@domain.com  username3

In [27]:
#Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
#all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
#function should return a new DataFrame that contains only the selected rows.

In [57]:
import pandas as pd

In [63]:
df = pd.DataFrame({'A': [3,8,6,2,9], 'B': [5,2,9,3,1] , 'C': [1,7,4,5,2]})

In [64]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [67]:
def ronak(a):
    return df[(df['A'] > 5 ) &  (df['B'] < 10 )]

In [68]:
ronak(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [ ]:
#Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
#median, and standard deviation of the values in the 'Values' column.

In [ ]:
import pandas as pd

In [74]:
df = pd.DataFrame({'Values' : [1,2,3,4,5,6,7,8,9,10,11]})

In [75]:
df

    Values
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8
8        9
9       10
10      11

In [76]:
def stst(a):
    mean = df['Values'].mean() 
    std = df['Values'].std()
    median = df['Values'].median()
    return mean , std , median

In [77]:
stst(df)

(6.0, 3.3166247903554, 6.0)

In [1]:
#Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
#create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
#for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
#should include the current day.

In [4]:
import pandas as pd

In [6]:
df =pd.DataFrame({'sales' : [1000,2000,1500,2300,1000,2000,3000] , 'date' : ['11th of april','12th of april','13th of april','14th of april','15th of april','16th of april','17th of april']})

In [7]:
df

   sales           date
0   1000  11th of april
1   2000  12th of april
2   1500  13th of april
3   2300  14th of april
4   1000  15th of april
5   2000  16th of april
6   3000  17th of april

In [10]:
def create_moving_average(df):
    df['MovingAverage'] = df['sales'].rolling(window=7).mean()
    
    return df

In [11]:
create_moving_average(df)

   sales           date  MovingAverage
0   1000  11th of april            NaN
1   2000  12th of april            NaN
2   1500  13th of april            NaN
3   2300  14th of april            NaN
4   1000  15th of april            NaN
5   2000  16th of april            NaN
6   3000  17th of april    1828.571429

In [12]:
#Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
#column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
#Monday, Tuesday) corresponding to each date in the 'Date' column.

In [41]:
import pandas as pd
import time

In [ ]:
df['Date'] = pd.to_datetime(df['Date'])

In [49]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [54]:
def rk(df):
    df['Weekday'] = df['Date'].dt.day_name()
    return df

In [55]:
rk(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [56]:
#Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
#function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [57]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15', '2023-02-01', '2023-03-01'],
                   'Value': [10, 20, 30, 40]})

In [58]:
df

         Date  Value
0  2023-01-01     10
1  2023-01-15     20
2  2023-02-01     30
3  2023-03-01     40

In [63]:
def rk2(df):
	return df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]

In [64]:
rk2(df)

        Date  Value
0 2023-01-01     10
1 2023-01-15     20

In [65]:
#Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
#be imported?

In [ ]:
'''to use the basic function of pandas 'pandas'library is necessary that need to be imported'''